balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GA108.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR21" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR21" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0x3f" edc:name="SS1R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U3CTSR" edc:desc="" edc:mask="0x3f" edc:name="U3CTSR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS1R0" edc:desc="" edc:mask="0x1" edc:name="SS1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R1" edc:desc="" edc:mask="0x1" edc:name="SS1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R2" edc:desc="" edc:mask="0x1" edc:name="SS1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R3" edc:desc="" edc:mask="0x1" edc:name="SS1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R4" edc:desc="" edc:mask="0x1" edc:name="SS1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R5" edc:desc="" edc:mask="0x1" edc:name="SS1R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U3CTSR0" edc:desc="" edc:mask="0x1" edc:name="U3CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3CTSR1" edc:desc="" edc:mask="0x1" edc:name="U3CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3CTSR2" edc:desc="" edc:mask="0x1" edc:name="U3CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3CTSR3" edc:desc="" edc:mask="0x1" edc:name="U3CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3CTSR4" edc:desc="" edc:mask="0x1" edc:name="U3CTSR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3CTSR5" edc:desc="" edc:mask="0x1" edc:name="U3CTSR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR22" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR22" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0x3f" edc:name="SDI2R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK2R" edc:desc="" edc:mask="0x3f" edc:name="SCK2R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI2R0" edc:desc="" edc:mask="0x1" edc:name="SDI2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R1" edc:desc="" edc:mask="0x1" edc:name="SDI2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R2" edc:desc="" edc:mask="0x1" edc:name="SDI2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R3" edc:desc="" edc:mask="0x1" edc:name="SDI2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R4" edc:desc="" edc:mask="0x1" edc:name="SDI2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R5" edc:desc="" edc:mask="0x1" edc:name="SDI2R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK2R0" edc:desc="" edc:mask="0x1" edc:name="SCK2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R1" edc:desc="" edc:mask="0x1" edc:name="SCK2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R2" edc:desc="" edc:mask="0x1" edc:name="SCK2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R3" edc:desc="" edc:mask="0x1" edc:name="SCK2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R4" edc:desc="" edc:mask="0x1" edc:name="SCK2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R5" edc:desc="" edc:mask="0x1" edc:name="SCK2R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR23" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR23" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS2R" edc:desc="" edc:mask="0x3f" edc:name="SS2R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS2R0" edc:desc="" edc:mask="0x1" edc:name="SS2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R1" edc:desc="" edc:mask="0x1" edc:name="SS2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R2" edc:desc="" edc:mask="0x1" edc:name="SS2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R3" edc:desc="" edc:mask="0x1" edc:name="SS2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R4" edc:desc="" edc:mask="0x1" edc:name="SS2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R5" edc:desc="" edc:mask="0x1" edc:name="SS2R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR27" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR27" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U4RXR" edc:desc="" edc:mask="0x3f" edc:name="U4RXR" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U4CTSR" edc:desc="" edc:mask="0x3f" edc:name="U4CTSR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U4RXR0" edc:desc="" edc:mask="0x1" edc:name="U4RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXR1" edc:desc="" edc:mask="0x1" edc:name="U4RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXR2" edc:desc="" edc:mask="0x1" edc:name="U4RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXR3" edc:desc="" edc:mask="0x1" edc:name="U4RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXR4" edc:desc="" edc:mask="0x1" edc:name="U4RXR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4RXR5" edc:desc="" edc:mask="0x1" edc:name="U4RXR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U4CTSR0" edc:desc="" edc:mask="0x1" edc:name="U4CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4CTSR1" edc:desc="" edc:mask="0x1" edc:name="U4CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4CTSR2" edc:desc="" edc:mask="0x1" edc:name="U4CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4CTSR3" edc:desc="" edc:mask="0x1" edc:name="U4CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4CTSR4" edc:desc="" edc:mask="0x1" edc:name="U4CTSR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U4CTSR5" edc:desc="" edc:mask="0x1" edc:name="U4CTSR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR28" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR28" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI3R" edc:desc="" edc:mask="0x3f" edc:name="SDI3R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK3R" edc:desc="" edc:mask="0x3f" edc:name="SCK3R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI3R0" edc:desc="" edc:mask="0x1" edc:name="SDI3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI3R1" edc:desc="" edc:mask="0x1" edc:name="SDI3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI3R2" edc:desc="" edc:mask="0x1" edc:name="SDI3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI3R3" edc:desc="" edc:mask="0x1" edc:name="SDI3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI3R4" edc:desc="" edc:mask="0x1" edc:name="SDI3R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI3R5" edc:desc="" edc:mask="0x1" edc:name="SDI3R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK3R0" edc:desc="" edc:mask="0x1" edc:name="SCK3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK3R1" edc:desc="" edc:mask="0x1" edc:name="SCK3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK3R2" edc:desc="" edc:mask="0x1" edc:name="SCK3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK3R3" edc:desc="" edc:mask="0x1" edc:name="SCK3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK3R4" edc:desc="" edc:mask="0x1" edc:name="SCK3R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK3R5" edc:desc="" edc:mask="0x1" edc:name="SCK3R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
